## Basics Operations on Pandas

In [25]:
df1=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[11,22,33,44,55],
    'D':[100,200,300,400,500]
})
df1

   A   B   C    D
0  1  10  11  100
1  2  20  22  200
2  3  30  33  300
3  4  40  44  400
4  5  50  55  500

In [33]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [34]:
df1.shape

(5, 4)

In [29]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
dtypes: int64(4)
memory usage: 292.0 bytes

In [ ]:
df1.describe

<bound method NDFrame.describe of    A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30>

In [37]:
#Broadcasting
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

## Create and Apply Functions in DataFrame

In [38]:
df1

   A   B   C    D
0  1  10  11  100
1  2  20  22  200
2  3  30  33  300
3  4  40  44  400
4  5  50  55  500

In [41]:
def square(x):
    return x*x

In [43]:
df1.apply(square) #It will not cange the original DataFrame

    A     B     C       D
0   1   100   121   10000
1   4   400   484   40000
2   9   900  1089   90000
3  16  1600  1936  160000
4  25  2500  3025  250000

In [48]:
df1['B']=df1['B'].apply(square) #It Change the original DataFrame

In [49]:
#Create a new column
df1['E']=df1['D'].apply(lambda : x**x)

TypeError: <lambda>() takes 0 positional arguments but 1 was given

## Missing Values

In [3]:
import numpy as np
import pandas as pd

In [20]:
data=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[2,4,np.nan,6,np.nan],
    'C':[3,6,9,np.nan,np.nan],
    'D':[np.nan,8,12,16,20],
    'E':[np.nan,11,15,np.nan,np.nan],
    'F':[6,12,18,24,30]
    })

In [5]:
df=pd.DataFrame(data)
print(df)

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [6]:
df.isna()

       A      B      C      D      E      F
0  False  False  False   True   True  False
1  False  False  False  False  False  False
2  False   True  False  False  False  False
3  False  False   True  False   True  False
4  False   True   True  False   True  False

In [7]:
df.isna().sum()

A    0
B    2
C    2
D    1
E    3
F    0
dtype: int64

In [8]:
df.isna().any()

A    False
B     True
C     True
D     True
E     True
F    False
dtype: bool

In [9]:
#Delete row with any nan value
df.dropna()
df.dropna(axis=0,how='any') #Both will give same output

   A    B    C    D     E   F
1  2  4.0  6.0  8.0  11.0  12

In [10]:
#Delete row with aall nan value
df.dropna(axis=0,how='all')

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [11]:
#Delete Col with any nan value
df.dropna(axis=1)
df.dropna(axis=1,how='any') #Both will give same output

   A   F
0  1   6
1  2  12
2  3  18
3  4  24
4  5  30

In [12]:
#Delete row with aall nan value
df.dropna(axis=1,how='all')

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [13]:
#Threshold -- At Least
df.dropna(thresh=4) #Atleast 4 Non Nan Calue in row

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24

In [14]:
df.dropna(axis=1,thresh=4) #Atleast 4 Non Nan Calue in column
print(df)

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [15]:
df

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [16]:
#Fill The Missing Value with 0
df.fillna(0)

   A    B    C     D     E   F
0  1  2.0  3.0   0.0   0.0   6
1  2  4.0  6.0   8.0  11.0  12
2  3  0.0  9.0  12.0  15.0  18
3  4  6.0  0.0  16.0   0.0  24
4  5  0.0  0.0  20.0   0.0  30

In [17]:
values={'A':100,'B':200,'C':300,'D':400,'E':500,'F':600}
df.fillna(value=values)

   A      B      C      D      E   F
0  1    2.0    3.0  400.0  500.0   6
1  2    4.0    6.0    8.0   11.0  12
2  3  200.0    9.0   12.0   15.0  18
3  4    6.0  300.0   16.0  500.0  24
4  5  200.0  300.0   20.0  500.0  30

In [18]:
#Fill with mean
df.fillna(df.mean())

   A    B    C     D     E   F
0  1  2.0  3.0  14.0  13.0   6
1  2  4.0  6.0   8.0  11.0  12
2  3  4.0  9.0  12.0  15.0  18
3  4  6.0  6.0  16.0  13.0  24
4  5  4.0  6.0  20.0  13.0  30

## Merging, Joining andConcatenation 

✅ merge → When you have common columns

✅ join → When index is already set

✅ concat → When stacking or combining data without logic

In [19]:
Employees = pd.DataFrame({
    "Emp_ID": [101, 102, 103, 104, 105],
    "Name": ["Annu", "Raahi", "Tanish", "Kirti", "Shivani"],
    "Department": ["IT", "HR", "Finance", "IT", "Sales"],
})

# DataFrame 2
Salaries = pd.DataFrame({
    "Emp_ID": [101, 102, 103, 106, 107],
    "Name": ["Tanish", "Arohi", "Priya", "Kirti", "Shivani"],
    "Salary": [50000, 55000, 60000, 45000, 47000]
})

print("Employees Data :")
print(df1)

print("\nSalary Data :")
print(df2)

Employees Data :

NameError: name 'df1' is not defined

#### Merging 

Merging usually Combines DataFrames based on common column(s)

In [ ]:
pd.merge(Employees,Salaries,how='inner',on='Emp_ID') #how has 'inner','outer','left','right'

   Emp_ID  Name_x Department  Name_y  Salary
0     101    Annu         IT  Tanish   50000
1     102   Raahi         HR   Arohi   55000
2     103  Tanish    Finance   Priya   60000

#### Joining
Joining Works mainly with index, not columns

In [ ]:
# Employees_indexed = Employees.set_index("Emp_ID")
# Salaries_indexed = Salaries.set_index("Emp_ID")

# join_result = Employees_indexed.join(Salaries_indexed, how="left", lsuffix="_emp", rsuffix="_sal")
# print(join_result)

#### Concatenation
Stacks DataFrames, does NOT match rows by default

In [ ]:
pd.concat([Employees,Salaries],axis=0) #Append rowsa dn if column does not match return NAN

   Emp_ID     Name Department   Salary
0     101     Annu         IT      NaN
1     102    Raahi         HR      NaN
2     103   Tanish    Finance      NaN
3     104    Kirti         IT      NaN
4     105  Shivani      Sales      NaN
0     101   Tanish        NaN  50000.0
1     102    Arohi        NaN  55000.0
2     103    Priya        NaN  60000.0
3     106    Kirti        NaN  45000.0
4     107  Shivani        NaN  47000.0

In [ ]:
pd.concat([Employees,Salaries],axis=1) #Side-by-side Index must align

   Emp_ID     Name Department  Emp_ID     Name  Salary
0     101     Annu         IT     101   Tanish   50000
1     102    Raahi         HR     102    Arohi   55000
2     103   Tanish    Finance     103    Priya   60000
3     104    Kirti         IT     106    Kirti   45000
4     105  Shivani      Sales     107  Shivani   47000

## Group by in Pandas

In [ ]:
import pandas as pd

store_data = pd.DataFrame({
    'Category': ['Electronics', 'Clothing', 'Grocery', 'Electronics', 'Clothing',
                 'Grocery', 'Electronics', 'Clothing', 'Grocery', 'Electronics'],
    
    'Store': ['Store_A', 'Store_B', 'Store_C', 'Store_A', 'Store_B',
              'Store_C', 'Store_A', 'Store_B', 'Store_C', 'Store_A'],
    
    'Sales': [5000, 3000, 1500, 7000, 4000,
              2000, 6500, 3500, 1800, 8000],
    
    'Quantity': [10, 15, 25, 12, 18,
                 30, 14, 16, 28, 20],
    
    'Date': pd.date_range('2023-01-01', periods=10)
})

print(store_data)

      Category    Store  Sales  Quantity       Date
0  Electronics  Store_A   5000        10 2023-01-01
1     Clothing  Store_B   3000        15 2023-01-02
2      Grocery  Store_C   1500        25 2023-01-03
3  Electronics  Store_A   7000        12 2023-01-04
4     Clothing  Store_B   4000        18 2023-01-05
5      Grocery  Store_C   2000        30 2023-01-06
6  Electronics  Store_A   6500        14 2023-01-07
7     Clothing  Store_B   3500        16 2023-01-08
8      Grocery  Store_C   1800        28 2023-01-09
9  Electronics  Store_A   8000        20 2023-01-10

In [ ]:
#Group by Category and Calculate sum of sales
category_group=store_data.groupby('Category')['Sales'].sum()
print(cat)

Category
Clothing       10500
Electronics    26500
Grocery         5300
Name: Sales, dtype: int64

In [ ]:
#Group by Stors and Calculate sum of sales
store_group=store_data.groupby('Store')['Sales'].sum()
print(store_group)

Store
Store_A    26500
Store_B    10500
Store_C     5300
Name: Sales, dtype: int64

In [ ]:
#Group by Categroy and Store
Category_Store_group=store_data.groupby(['Category','Store'])['Sales'].sum()
print(Category_Store_group) 
## Getting Wrong Output !

Category     Store
Clothing     Store_B    10500
Electronics  Store_A    26500
Grocery      Store_C     5300
Name: Sales, dtype: int64

### Aggregation

In [ ]:
mean=store_data['Sales'].mean()
print(mean)

4230.0

In [ ]:
#Multiple Agg Function
store_data['Sales'].agg(['mean','median','min','max','count'])

mean      4230.0
median    3750.0
min       1500.0
max       8000.0
count       10.0
Name: Sales, dtype: float64